Revit 2024 API
CeilingType Class
 Represents a ceiling type in Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class CeilingType : HostObjAttributes
Visual Basic
Public Class CeilingType _
	Inherits HostObjAttributes
Visual C++
public ref class CeilingType : public HostObjAttributes
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.CeilingType
See Also
CeilingType Members
Autodesk.Revit.DB Namespace